AccumulationRegisters/ВыпускПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ВыпускПродукции</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СпецификацииПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СпецификацииПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыНаПроизводство</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КомплектацииПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КомплектацииПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыПополненияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СпособыПополненияЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/СозданиеНаОснованииУточнениеКоличества/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Если Параметры.ИмяМенеджераДокумента = "ГрупповоеСоздание" Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = Нстр("ru = 'Создание заказов с разузлованием'");
			
			Если ЗапасыЗаполнены(Параметры.Основание) Тогда
				ЗаполнитьДеревоЗаказов(Параметры.Основание);
			КонецЕсли;
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаДерево;
		ИначеЕсли Не Параметры.ИмяМенеджераДокумента = "СборкаЗапасов" Тогда
			ЗаполнитьТоварыИзЗаказаПокупателя();
		Иначе
			ЗаполнитьТоварыДляСборкиЗапасов();
			УстановитьВидимостьЭлементов();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ЗаполнитьПоЗаказуНаПроизводство();
		УстановитьВидимостьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	Результат = Новый Структура("АдресТовары,Основание,КоличествоИзделий");
	СтруктураВозврата = АдресТовары();
	Результат.АдресТовары 		= СтруктураВозврата.АдресТовары;
	Результат.Основание 		= Параметры.Основание;
	Результат.КоличествоИзделий = СтруктураВозврата.КоличествоИзделий;
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказыИерархически(Команда)
	Основание = Параметры.Основание;
	
	СоздатьЗаказыСРазузлованием(Основание);
	ЗаполнитьДеревоЗаказов(Основание);
	Элементы["СоздатьЗаказы"].Доступность = Ложь;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПрограммно

&НаКлиенте
Процедура ПриНачалеРедактирования(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Заказ = Элемент.ТекущиеДанные.Заказ;
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Ключ", Заказ);
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		ОткрытьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаДокумента", СтруктураОткрытия, ЭтотОбъект);
	Иначе
		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаДокумента", СтруктураОткрытия, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапасыЗаполнены(Основание)
	ЗапросЗапасов = Новый Запрос;
	ЗапросЗапасов.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЗаказПокупателяЗапасы.Номенклатура) КАК Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка";
	ЗапросЗапасов.УстановитьПараметр("Ссылка", Основание);
	Выборка = ЗапросЗапасов.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.Количество > 0 Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	
	Элементы.ТоварыЯчейка.Видимость = Ложь;
	Элементы.ТоварыСклад.Видимость = Ложь;
	Элементы.ТоварыКомплектация.Видимость = Ложь;
	Элементы.ТоварыСпецификация.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДеревоЗаказов(Основание)
	ЗапросПродукции = Новый Запрос;
	ЗапросПродукции.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ЗапросПродукции.Текст = "ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ВременнаяТаблицаПродукция
	|ИЗ
	|	&Продукция КАК ЗаказПокупателяЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыпускПродукции.Регистратор КАК Заказ,
	|	ВыпускПродукции.Номенклатура КАК Номенклатура,
	|	ВыпускПродукции.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ВыпускПродукции.КоличествоПлан, 0) КАК Количество,
	|	ВыпускПродукции.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВыпускПродукции.Регистратор.ДокументОснование КАК Родитель,
	|	ВыпускПродукции.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.ЗаказПокупателя = &ЗаказПокупателя
	|	И ВыпускПродукции.КоличествоПлан > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказыПокупателей.Регистратор,
	|	ЗаказыПокупателей.Номенклатура,
	|	ЗаказыПокупателей.Характеристика,
	|	ЗаказыПокупателей.Количество,
	|	ЗаказыПокупателей.ЗаказПокупателя,
	|	ЗаказыПокупателей.Регистратор,
	|	ЕСТЬNULL(ВременнаяТаблицаПродукция.Спецификация, СпецификацииПоУмолчанию.Спецификация)
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПоУмолчанию КАК СпецификацииПоУмолчанию
	|		ПО (ЗаказыПокупателей.Номенклатура = СпецификацииПоУмолчанию.Номенклатура
	|		И ЗаказыПокупателей.Характеристика = СпецификацииПоУмолчанию.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПродукция КАК ВременнаяТаблицаПродукция
	|		ПО (ЗаказыПокупателей.Номенклатура = ВременнаяТаблицаПродукция.Номенклатура
	|		И ЗаказыПокупателей.Характеристика = ВременнаяТаблицаПродукция.Характеристика
	|		И ЗаказыПокупателей.Номенклатура = ВременнаяТаблицаПродукция.Номенклатура
	|		И ЗаказыПокупателей.Характеристика = ВременнаяТаблицаПродукция.Характеристика)
	|ГДЕ
	|	ЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ЗаказыПокупателей.ЗаказПокупателя = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Заказ КАК Заказ,
	|	ВременнаяТаблица.Родитель КАК Родитель,
	|	ТИПЗНАЧЕНИЯ(ВременнаяТаблица.Заказ) КАК Порядок
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Заказ,
	|	ВременнаяТаблица.Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ";
	ЗапросПродукции.УстановитьПараметр("ЗаказПокупателя", Основание);
	ЗапросПродукции.УстановитьПараметр("Продукция",Основание.Запасы.Выгрузить() );
	РезультатЗапроса = ЗапросПродукции.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если Не Колонка.Имя = "Порядок" Тогда
			Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаГруппировки = Дерево.Строки.Найти(СтрокаТаблицы.Родитель, "Заказ", Истина);
		Если СтрокаГруппировки = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), СтрокаТаблицы);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаГруппировки.Строки.Добавить(), СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Возврат Дерево;
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоЗаказов(Основание)
	Дерево = СоздатьДеревоЗаказов(Основание);
	Если Элементы.Найти("ДеревоПрограммно") <> Неопределено Тогда
		ЗначениеВРеквизитФормы(Дерево, "ДеревоПрограммно");
	Иначе
		МассивДобавляемыхРеквизитов = Новый массив;
		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДеревоПрограммно",
		Новый ОписаниеТипов("ДеревоЗначений")));
		Для Каждого Колонка Из Дерево.Колонки Цикл
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,
			"ДеревоПрограммно"));
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		ЗначениеВРеквизитФормы(Дерево, "ДеревоПрограммно");
		
		ЭлементДерево = Элементы.Добавить("ДеревоПрограммно", Тип("ТаблицаФормы"), Элементы.ГруппаСтраницаДерево);
		ЭлементДерево.ПутьКДанным = "ДеревоПрограммно";
		ЭлементДерево.Отображение = ОтображениеТаблицы.Дерево;
		ЭлементДерево.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ЭлементДерево.УстановитьДействие("Выбор", "ПриНачалеРедактирования");
		
		КоманднаяПанельДерева = Элементы.Добавить("КоманднаяПанельДерева", Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницаДерево);
		КоманднаяПанельДерева.Вид = ВидГруппыФормы.КоманднаяПанель;
		
		КнопкаФормы = Элементы.Добавить("СоздатьЗаказы", Тип("КнопкаФормы"), КоманднаяПанельДерева);
		КнопкаФормы.ИмяКоманды = "СоздатьЗаказыИерархически";
		КнопкаФормы.Заголовок = Нстр("ru = 'Создать заказы'");
		МассивСообщений = ПроверитьКорректностьСпецификаций(Дерево.Строки);
		Если Дерево.Строки[0].Строки.Количество() > 0  Тогда
			КнопкаФормы.Доступность = Ложь;
		КонецЕсли;
		
		Если МассивСообщений.Количество() > 0 и Дерево.Строки.Количество() = 1 Тогда
			Для Каждого ЭлементМассива из МассивСообщений Цикл
				ОбщегоНазначения.СообщитьПользователю(ЭлементМассива);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Колонка Из Дерево.Колонки Цикл
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ЭлементДерево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			Если НовыйЭлемент.Имя = "Заказ" Тогда
				НовыйЭлемент.Заголовок = Нстр("ru = 'Заказ'");
				НовыйЭлемент.КнопкаВыбора = Ложь;
			ИначеЕсли НовыйЭлемент.Имя = "ЗаказПокупателя" Тогда
				НовыйЭлемент.Заголовок = Нстр("ru = 'Заказ покупателя'");
			Иначе
				НовыйЭлемент.Доступность = Ложь;
			КонецЕсли;
			НовыйЭлемент.ПутьКДанным = "ДеревоПрограммно." + Колонка.Имя;
			Если Колонка.Имя = "Родитель" Или Колонка.Имя = "Порядок" Тогда
				НовыйЭлемент.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьКорректностьСпецификаций(Строки,Уровень = 1)
	МассивСообщений = Новый Массив();
	Для Каждого Строка из Строки Цикл
		МассивСтрок = Строка.Заказ.Запасы.НайтиСтроки(Новый Структура("Спецификация",Справочники.Спецификации.ПустаяСсылка()));
		Для Каждого ЭлементМассива из МассивСтрок Цикл 
			МассивСообщений.Добавить(СтрШаблон("Для строки %1 не заполнена спецификация, заказ будет создан по спецификации по умолчанию",ЭлементМассива.НомерСтроки));
		КонецЦикла;
	КонецЦикла;
	Возврат МассивСообщений;
КонецФункции

&НаСервере
Процедура СоздатьЗаказыСРазузлованием(Основание)
	ЗапросПродукции = Новый Запрос;
	ЗапросПродукции.Текст = "ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВыпускПродукции.Регистратор.ДокументОснование) КАК Представление,
	|	ВыпускПродукции.Регистратор КАК Заказ,
	|	ВыпускПродукции.Номенклатура КАК Номенклатура,
	|	ВыпускПродукции.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ВыпускПродукции.КоличествоПлан, 0) КАК Количество,
	|	ВыпускПродукции.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВыпускПродукции.Регистратор.ДокументОснование КАК Родитель,
	|	ВыпускПродукции.Спецификация
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.ЗаказПокупателя = &ЗаказПокупателя
	|	И ВыпускПродукции.КоличествоПлан > 0";
	ЗапросПродукции.УстановитьПараметр("ЗаказПокупателя", Основание);
	РезультатЗапроса = ЗапросПродукции.Выполнить();
	ВыборкаСостава = РезультатЗапроса.Выбрать();
	
	Если ВыборкаСостава.Количество() = 0 Тогда
		ЗапросПродукции.Текст = "ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказыПокупателей.ЗаказПокупателя) КАК Представление,
		|	ЗаказыПокупателей.Регистратор КАК Заказ,
		|	ЗаказыПокупателей.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателей.Характеристика КАК Характеристика,
		|	ЗаказыПокупателей.Количество КАК Количество,
		|	ЗаказыПокупателей.ЗаказПокупателя КАК ЗаказПокупателя,
		|	NULL КАК Родитель,
		|	ЗаказПокупателяЗапасы.Спецификация КАК Спецификация
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ПО ЗаказыПокупателей.ЗаказПокупателя = ЗаказПокупателяЗапасы.Ссылка
		|			И ЗаказыПокупателей.Номенклатура = ЗаказПокупателяЗапасы.Номенклатура
		|			И ЗаказыПокупателей.Характеристика = ЗаказПокупателяЗапасы.Характеристика
		|ГДЕ
		|	ЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ЗаказыПокупателей.ЗаказПокупателя = &ЗаказПокупателя";
		ЗапросПродукции.УстановитьПараметр("ЗаказПокупателя", Основание);
		ВыборкаСостава = ЗапросПродукции.Выполнить().Выбрать();
	КонецЕсли;
	
	Если ВыборкаСостава.Количество() > 0 Тогда
		ВыборкаСостава.Следующий();
		Таблица = ПроизводствоСервер.ПодготовитьДанные(ВыборкаСостава.Номенклатура, ВыборкаСостава.Характеристика,
		ВыборкаСостава.Количество, ВыборкаСостава.Спецификация, Основание.Дата, Основание.Видцен); 
		Дерево = Новый ДеревоЗначений;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл		
				СтрокаГруппировки = Дерево.Строки.Найти(СтрокаТаблицы.ИдентификаторРодителя, "ИдентификаторСтроки", Истина);
				Если СтрокаГруппировки = Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), СтрокаТаблицы);
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаГруппировки.Строки.Добавить(), СтрокаТаблицы);
				КонецЕсли;
		КонецЦикла;
		МассивИнентификаторов = Новый Массив;
		РазузловатьВМакет(Дерево, Основание, Неопределено, МассивИнентификаторов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказуНаПроизводство()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыНаПроизводствоОстатки.Номенклатура,
	|	ЗаказыНаПроизводствоОстатки.Характеристика,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоПоДокументу,
	|	ЗаказНаПроизводствоПродукция.Спецификация
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки(, ЗаказНаПроизводство = &Заказ) КАК ЗаказыНаПроизводствоОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
	|		ПО ЗаказыНаПроизводствоОстатки.Номенклатура = ЗаказНаПроизводствоПродукция.Номенклатура
	|		И ЗаказыНаПроизводствоОстатки.Характеристика = ЗаказНаПроизводствоПродукция.Характеристика
	|ГДЕ
	|	ЗаказНаПроизводствоПродукция.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Параметры.Основание);
	Запрос.УстановитьПараметр("СпособПополнения", Перечисления.СпособыПополненияЗапасов.Производство);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	Товары.Загрузить(ТаблицаОстатков);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыИзЗаказаПокупателя()
	
	//@skip-check wrong-string-literal-content
	ПоложениеСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Основание, "ПоложениеСклада");
	Элементы.ТоварыСклад.Видимость 	=  ПоложениеСклада = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	
	Элементы.ТоварыЯчейка.Видимость = ПолучитьФункциональнуюОпцию("УчетПоЯчейкам");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	Товары.Ячейка КАК Ячейка,
	|	СУММА(Товары.Количество) КАК КоличествоПоДокументу,
	|	КомплектацииПоУмолчанию.Комплектация КАК Комплектация,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ИСТИНА) КАК Отметка
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектацииПоУмолчанию КАК КомплектацииПоУмолчанию
	|		ПО Товары.Номенклатура = КомплектацииПоУмолчанию.Номенклатура
	|			И Товары.Характеристика = КомплектацииПоУмолчанию.Характеристика
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КомплектацииПоУмолчанию.Комплектация,
	|	Товары.Ячейка,
	|	Товары.Характеристика,
	|	Товары.СтруктурнаяЕдиницаРезерв,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Параметры.Основание);
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(ТаблицаТовары);
	//
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыДляСборкиЗапасов()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) КАК КоличествоПоДокументу,
	|	ЗаказыОстатки.Спецификация
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|		ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|		(ЗаказПокупателяЗапасы.Количество - ЗаказПокупателяЗапасы.Резерв) * ВЫБОР
	|			КОГДА ЗаказПокупателяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|				ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК КоличествоОстаток,
	|		ЗаказПокупателяЗапасы.Спецификация
	|	ИЗ
	|		Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|	ГДЕ
	|		ЗаказПокупателяЗапасы.Ссылка = &ЗаказПокупателя
	|		И ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас = ИСТИНА
	|		И ЗаказПокупателяЗапасы.Номенклатура.СпособПополнения = &СпособПополнения
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВыпускПродукции.Номенклатура,
	|		ВыпускПродукции.Характеристика,
	|		-ВыпускПродукции.КоличествоОборот,
	|		ВыпускПродукции.Спецификация
	|	ИЗ
	|		РегистрНакопления.ВыпускПродукции.Обороты(,, Авто, ЗаказПокупателя = &ЗаказПокупателя) КАК ВыпускПродукции) КАК
	|		ЗаказыОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыОстатки.Номенклатура,
	|	ЗаказыОстатки.Характеристика,
	|	ЗаказыОстатки.Спецификация
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыОстатки.КоличествоОстаток) > 0";
	Запрос.УстановитьПараметр("ЗаказПокупателя", Параметры.Основание);
	Запрос.УстановитьПараметр("СпособПополнения", Перечисления.СпособыПополненияЗапасов.Производство);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаОстатков = МассивРезультатов[0].Выгрузить();
	Товары.Загрузить(ТаблицаОстатков);
	
КонецПроцедуры

&НаСервере
Процедура РазузловатьВМакет(Дерево, Заказ, Идентификатор = Неопределено, МассивИнентификаторов = Неопределено)
	
	Для Каждого Элемент Из Дерево.Строки Цикл
		Если Элемент.Строки.Количество() > 0 И Элемент.Собирается И Элемент.Уровень
			<> Идентификатор Тогда
			//верхний уровень
			Индекс = МассивИнентификаторов.Найти(Элемент.Уровень);
			Если Индекс = Неопределено Тогда
				НовыйЗаказ = Документы.ЗаказНаПроизводство.СоздатьДокумент();
				Новыйзаказ.Заполнить(Заказ);
				НовыйЗаказ.Дата = ТекущаяДатаСеанса();
				НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
				МассивИнентификаторов.Добавить(Элемент.Уровень); 
				РазузловатьВМакет(Элемент, НовыйЗаказ.Ссылка, Элемент.Уровень, МассивИнентификаторов);
			КонецЕсли;
			
		Иначе
			РазузловатьВМакет(Элемент, Заказ, Элемент.Уровень);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция АдресТовары()

	ОтмеченныеЗапасы = Товары.Выгрузить(Новый Структура("Отметка", Истина));

	Запрос = Новый Запрос;
	Если Не Параметры.ИмяМенеджераДокумента = "СборкаЗапасов" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.ОсновнойВариантКП КАК ОсновнойВариантКП
		|ПОМЕСТИТЬ ВТЗаказы
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТМаксНомерСтрокиЗапасы
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|ГДЕ
		|	ЗаказПокупателяЗапасы.Ссылка = &Ссылки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
		|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяЗапасы.НомерВариантаКП КАК НомерВариантаКП,
		|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
		|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|	ЗаказПокупателяЗапасы.Партия КАК Партия,
		|	ЗаказПокупателяЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ЗаказПокупателяЗапасы.Резерв КАК Резерв,
		|	ЗаказПокупателяЗапасы.РезервОтгрузка КАК РезервОтгрузка,
		|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	ЗаказПокупателяЗапасы.Ячейка КАК Ячейка,
		|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент,
		|	ЗаказПокупателяЗапасы.Цена КАК Цена,
		|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|	ЗаказПокупателяЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
		|	ЗаказПокупателяЗапасы.ПродажаПодарка КАК ПродажаПодарка,
		|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
		|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
		|	ЗаказПокупателяЗапасы.Всего КАК Всего,
		|	ЗаказПокупателяЗапасы.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказПокупателяЗапасы.Спецификация КАК Спецификация,
		|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
		|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ЗаказПокупателяЗапасы.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
		|	ЗаказПокупателяЗапасы.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас
		|			ТОГДА ЗаказПокупателяЗапасы.КоличествоСобрано
		|		ИНАЧЕ ЗаказПокупателяЗапасы.Количество
		|	КОНЕЦ КАК КоличествоСобрано,
		|	ВЫБОР
		|		КОГДА ФункциональнаяОпцияИспользоватьСборкуЗаказов.Значение
		|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.СтатусСборки > 0
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСборка,
		|	ЗаказПокупателяЗапасы.КлючСвязи КАК КлючСвязи,
		|	ЗаказПокупателяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ЗаказПокупателяЗапасы.НомерГТД КАК НомерГТД,
		|	ЗаказПокупателяЗапасы.Вес КАК Вес,
		|	ЗаказПокупателяЗапасы.Объем КАК Объем,
		|	ЗаказПокупателяЗапасы.НоменклатураНабора КАК НоменклатураНабора,
		|	ЗаказПокупателяЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЗаказПокупателяЗапасы.ДоляСтоимости КАК ДоляСтоимости,
		|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ПОМЕСТИТЬ ВТЗаказПокупателяЗапасы
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
		|		ПО (Заказы.Ссылка = ЗаказПокупателяЗапасы.Ссылка)
		|			И (Заказы.ОсновнойВариантКП = ЗаказПокупателяЗапасы.НомерВариантаКП),
		|	Константа.ФункциональнаяОпцияИспользоватьСборкуЗаказов КАК ФункциональнаяОпцияИспользоватьСборкуЗаказов
		|ГДЕ
		|	НЕ ЗаказПокупателяЗапасы.ЭтоРазделитель
		|	И ЗаказПокупателяЗапасы.Номенклатура В(&Запасы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЕСТЬNULL(ВТМаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
		|	Заказы.ОсновнойВариантКП,
		|	ЗаказПокупателя.НоменклатураДоставки,
		|	ЛОЖЬ,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
		|	"""",
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка),
		|	NULL,
		|	ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения,
		|	1,
		|	ЗаказПокупателя.СтоимостьДоставки,
		|	0,
		|	NULL,
		|	ЛОЖЬ,
		|	ЗаказПокупателя.СтоимостьДоставки,
		|	ЗаказПокупателя.СтавкаНДСДоставки,
		|	ЗаказПокупателя.СуммаНДСДоставки,
		|	ЗаказПокупателя.СтоимостьДоставки + ВЫБОР
		|		КОГДА ЗаказПокупателя.СуммаВключаетНДС
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказПокупателя.СуммаНДСДоставки
		|	КОНЕЦ,
		|	ЗаказПокупателя.ДатаОтгрузки,
		|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка),
		|	"""",
		|	0,
		|	0,
		|	0,
		|	1,
		|	1,
		|	ЛОЖЬ,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
		|	0,
		|	0,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	0,
		|	NULL
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
		|		ПО (Заказы.Ссылка = ЗаказПокупателя.Ссылка)
		|			И (ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
		|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаксНомерСтрокиЗапасы КАК ВТМаксНомерСтрокиЗапасы
		|		ПО (ВТМаксНомерСтрокиЗапасы.Ссылка = ЗаказПокупателя.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗаказПокупателяЗапасы.Ссылка КАК ЗаказПокупателя,
		|	ВТЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
		|	ВТЗаказПокупателяЗапасы.НомерВариантаКП КАК НомерВариантаКП,
		|	ВТЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗаказПокупателяЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
		|	ВТЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
		|	ВТЗаказПокупателяЗапасы.Партия КАК Партия,
		|	ВТЗаказПокупателяЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ВТЗаказПокупателяЗапасы.Резерв КАК Резерв,
		|	ВТЗаказПокупателяЗапасы.РезервОтгрузка КАК РезервОтгрузка,
		|	ВТЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	ВТЗаказПокупателяЗапасы.Ячейка КАК Ячейка,
		|	ВТЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТЗаказПокупателяЗапасы.Коэффициент КАК Коэффициент,
		|	ВТЗаказПокупателяЗапасы.Цена КАК Цена,
		|	ВТЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|	ВТЗаказПокупателяЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
		|	ВТЗаказПокупателяЗапасы.ПродажаПодарка КАК ПродажаПодарка,
		|	ВТЗаказПокупателяЗапасы.Сумма КАК Сумма,
		|	ВТЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	ВТЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
		|	ВТЗаказПокупателяЗапасы.Всего КАК Всего,
		|	ВТЗаказПокупателяЗапасы.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВТЗаказПокупателяЗапасы.Спецификация КАК Спецификация,
		|	ВТЗаказПокупателяЗапасы.Содержание КАК Содержание,
		|	ВТЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ВТЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТЗаказПокупателяЗапасы.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
		|	ВТЗаказПокупателяЗапасы.Количество КАК Количество,
		|	ВТЗаказПокупателяЗапасы.КоличествоСобрано КАК КоличествоСобрано,
		|	ВТЗаказПокупателяЗапасы.ЕстьСборка КАК ЕстьСборка,
		|	ВТЗаказПокупателяЗапасы.КлючСвязи КАК КлючСвязи,
		|	ВТЗаказПокупателяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВТЗаказПокупателяЗапасы.НомерГТД КАК НомерГТД,
		|	ВТЗаказПокупателяЗапасы.Вес КАК Вес,
		|	ВТЗаказПокупателяЗапасы.Объем КАК Объем,
		|	ВТЗаказПокупателяЗапасы.НоменклатураНабора КАК НоменклатураНабора,
		|	ВТЗаказПокупателяЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ВТЗаказПокупателяЗапасы.ДоляСтоимости КАК ДоляСтоимости,
		|	ВТЗаказПокупателяЗапасы.ТипНоменклатуры КАК ТипНоменклатуры,
		|	КомплектацииПоУмолчанию.Комплектация КАК Комплектация
		|ИЗ
		|	ВТЗаказПокупателяЗапасы КАК ВТЗаказПокупателяЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектацииПоУмолчанию КАК КомплектацииПоУмолчанию
		|		ПО ВТЗаказПокупателяЗапасы.Номенклатура = КомплектацииПоУмолчанию.Номенклатура
		|			И ВТЗаказПокупателяЗапасы.Характеристика = КомплектацииПоУмолчанию.Характеристика";

		Запрос.УстановитьПараметр("Ссылки", Параметры.Основание);
		Запрос.УстановитьПараметр("Запасы", ОтмеченныеЗапасы);

		Результаты 				= Запрос.Выполнить();
		ТаблицаТоваров 			= Результаты.Выгрузить();
		КоличествоИзделий		= ОтмеченныеЗапасы.Количество();
		АдресТовары 			= ПоместитьВоВременноеХранилище(ТаблицаТоваров);
		Возврат Новый Структура("АдресТовары,КоличествоИзделий", АдресТовары, КоличествоИзделий);
	Иначе
		КоличествоИзделий		= ОтмеченныеЗапасы.Количество();
		АдресТовары 			= ПоместитьВоВременноеХранилище(ОтмеченныеЗапасы);
		Возврат Новый Структура("АдресТовары,КоличествоИзделий", АдресТовары, КоличествоИзделий);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Отметить(Команда)
	ЗаполнитьОтметки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	ЗаполнитьОтметки(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтметки(ЗначениеОтметки)
	
	ТаблицаЗаполняемыхЗначений = Товары.Выгрузить();
	ТаблицаЗаполняемыхЗначений.ЗаполнитьЗначения(ЗначениеОтметки, "Отметка");
	Товары.Загрузить(ТаблицаЗаполняемыхЗначений);
	
КонецПроцедуры

#КонецОбласти
